CSI API ETABS v1
cStory.GetStories Method
 This function is DEPRECATED. Please refer to GetStories_2(Double, Int32, String[], Double[], Double[], Boolean[], String[], Boolean[], Double[], Int32[])
 Retrieves the story information for the current tower
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetStories(
	ref int NumberStories,
	ref string[] StoryNames,
	ref double[] StoryElevations,
	ref double[] StoryHeights,
	ref bool[] IsMasterStory,
	ref string[] SimilarToStory,
	ref bool[] SpliceAbove,
	ref double[] SpliceHeight
)
Function GetStories (
	ByRef NumberStories As Integer,
	ByRef StoryNames As String(),
	ByRef StoryElevations As Double(),
	ByRef StoryHeights As Double(),
	ByRef IsMasterStory As Boolean(),
	ByRef SimilarToStory As String(),
	ByRef SpliceAbove As Boolean(),
	ByRef SpliceHeight As Double()
) As Integer
Dim instance As cStory
Dim NumberStories As Integer
Dim StoryNames As String()
Dim StoryElevations As Double()
Dim StoryHeights As Double()
Dim IsMasterStory As Boolean()
Dim SimilarToStory As String()
Dim SpliceAbove As Boolean()
Dim SpliceHeight As Double()
Dim returnValue As Integer
returnValue = instance.GetStories(NumberStories,
	StoryNames, StoryElevations, StoryHeights,
	IsMasterStory, SimilarToStory, SpliceAbove,
	SpliceHeight)
int GetStories(
	int% NumberStories,
	array<String^>^% StoryNames,
	array<double>^% StoryElevations,
	array<double>^% StoryHeights,
	array<bool>^% IsMasterStory,
	array<String^>^% SimilarToStory,
	array<bool>^% SpliceAbove,
	array<double>^% SpliceHeight
)
abstract GetStories :
        NumberStories : int byref *
        StoryNames : string[] byref *
        StoryElevations : float[] byref *
        StoryHeights : float[] byref *
        IsMasterStory : bool[] byref *
        SimilarToStory : string[] byref *
        SpliceAbove : bool[] byref *
        SpliceHeight : float[] byref -> int
Parameters
NumberStories
Type: System.Int32
 The number of stories. All output arrays have length (NumberStories + 1), because they include values for "Base" , which is not a story.
StoryNames
Type: System.String[]
 The names of the stories. This array will include "Base" .
StoryElevations
Type: System.Double[]
 The story elevations. The first value is the "Base" elevation.
StoryHeights
Type: System.Double[]
 The story heights. The first value is the "Base" height.
IsMasterStory
Type: System.Boolean[]
 Whether the story is a master story
SimilarToStory
Type: System.String[]
 If the story is not a master story, which master story the story is similar to
SpliceAbove
Type: System.Boolean[]
 This is True if the story has a splice height, and False otherwise
SpliceHeight
Type: System.Double[]
 The story splice height
Return Value
Type: Int32
 Returns zero if the story data is successfully retrieved, otherwise returns nonzero.
Remarks
 To change the current tower, use SetActiveTower(String)
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberStories As Integer
       Dim StoryNames() As String
       Dim StoryHeights() As Double
       Dim StoryElevations() As Double
       Dim IsMasterStory() As Boolean
       Dim SimilarToStory() As String
       Dim SpliceAbove() As Boolean
       Dim SpliceHeight() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get stories
   ret = SapModel.Story.GetStories(NumberStories, StoryNames, StoryHeights, StoryElevations, _
                                   IsMasterStory, SimilarToStory, SpliceAbove, SpliceHeight)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace